In [1]:
import pandas as pd

In [5]:
my_series = pd.Series([1, 6, 3.5, -5, 8])

In [6]:
my_series

0    1.0
1    6.0
2    3.5
3   -5.0
4    8.0
dtype: float64

In [7]:
my_series[1]

6.0

In [8]:
my_series[1:4]

1    6.0
2    3.5
3   -5.0
dtype: float64

In [9]:
my_series[my_series > 0]

0    1.0
1    6.0
2    3.5
4    8.0
dtype: float64

In [10]:
my_series * 2

0     2.0
1    12.0
2     7.0
3   -10.0
4    16.0
dtype: float64

In [11]:
import numpy as np

In [12]:
np.exp(my_series)

0       2.718282
1     403.428793
2      33.115452
3       0.006738
4    2980.957987
dtype: float64

In [13]:
np.sum(my_series)

13.5

In [33]:
df = pd.DataFrame({
    'name': ['Маша', 'Вася', 'Эдуард'],
    'age': [25, 8, 48],
    'job': ['Программист', 'Школьник', 'Big boss'],
    'salary': [100, 10, 200]
}, index=['some', 'random', 'words'])

In [34]:
df

          name  age          job  salary
some      Маша   25  Программист     100
random    Вася    8     Школьник      10
words   Эдуард   48     Big boss     200

In [20]:
df

     name  age          job  salary
0    Маша   25  Программист     100
1    Вася    8     Школьник      10
2  Эдуард   48     Big boss     200

In [21]:
name = df['name']

In [22]:
name

0      Маша
1      Вася
2    Эдуард
Name: name, dtype: object

In [26]:
df[df['salary'] >= 100]

     name  age          job  salary
0    Маша   25  Программист     100
2  Эдуард   48     Big boss     200

In [27]:
df['salary'] *= 10

In [28]:
df

     name  age          job  salary
0    Маша   25  Программист    1000
1    Вася    8     Школьник     100
2  Эдуард   48     Big boss    2000

In [29]:
df['salary'] / 2

0     500.0
1      50.0
2    1000.0
Name: salary, dtype: float64

In [30]:
df

     name  age          job  salary
0    Маша   25  Программист    1000
1    Вася    8     Школьник     100
2  Эдуард   48     Big boss    2000

In [35]:
df.loc['some':'random']

        name  age          job  salary
some    Маша   25  Программист     100
random  Вася    8     Школьник      10

In [36]:
df.iloc[1]

name          Вася
age              8
job       Школьник
salary          10
Name: random, dtype: object

In [37]:
df.iloc[:1]

      name  age          job  salary
some  Маша   25  Программист     100

In [38]:
df.T

               some    random     words
name           Маша      Вася    Эдуард
age              25         8        48
job     Программист  Школьник  Big boss
salary          100        10       200